Repository: AA122AA/StudFiles_Bonch_Baka
Catalog: 4 курс/7 сем/crypto/lab5/*/RSA.po
Languages: ru

source: Seed
ru: Инициализация ГСЧ

source: Initialize random number generator
ru: Инициализация генератора случайных чисел

source: &Quit
ru: Выход

source: Quit from programm
ru: Выйти из программы

source: File
ru: Файл

source: Small public exponent
ru: Малая шифрующая экспонента

source: Hastad's broadcast attack
ru: Атака Хастада

source: Small amount of possible messages
ru: Малое количество возможных сообщений

source: Linear search of encrypted message from the list of known messages
ru: Поиск зашифрованного сообщения путем полного перебора криптограмм по списку соответствующиму всех известным сообщением

source: Small private exponent
ru: Малая экспонента дешифрования

source: Wiener's attack
ru: Атака Винера

source: Blinding attack
ru: Атака, используящая мультипликативное свойство алгоритма РША

source: Attack using multiplicative property of RSA encryption
ru: Атака, использующая мультипликативное свойство шифра РША

source: Cyclic attack
ru: Циклическая атака

source: Common modulus attack
ru: Атака на общие модули

source: Factoring modulus knowing both exponents (secret and public)
ru: Факторизация модуля РША при помощи двух экспонент (открытой и секретной)

source: Attack type
ru: Тип атаки

source: View &Help
ru: Показать справку

source: About
ru: О программе

source: Help
ru: Справка

source: Hastad's broadcast attack on small public exponent e
ru: Атака Хастада на малую открытую экспоненту "e"

source: RSA key length:
ru: Длина ключа РША:

source: Generate 3 RSA key sets
ru: Сгенерировать 3 набора ключей

source: public exponent 'e'
ru: открытая экспонента 'e'

source: private exponent 'd'
ru: секретная экспонента 'd'

source: modulus 'n'
ru: модуль 'n'

source: prime number 'p'
ru: простое число 'p'

source: prime number 'q'
ru: простое число 'q'

source: Message to encrypt:
ru: Шифруемое сообщение:

source: Generate random message
ru: Сгенерировать случайное сообщение

source: Encrypt
ru: Зашифровать

source: Ciphertext:
ru: Криптограмма:

source: Evaluate CRT solution
ru: Вычислить решение системы уравнений

source: Find cube root using Newton's method
ru: Найти кубический корень методом Ньютона

source: Generate RSA keys
ru: Сгенерировать кючи РША

source: Number of possible messages:
ru: Число возможным сообщений:

source: Generate list of possible messages
ru: Сгенерировать список возможных сообщений

source: List of possible messages:
ru: Список возможных сообщений:

source: Encrypt random message from above list
ru: Зашифровать случайное сообщение из списка

source: Chosen message:
ru: Выбранное сообщение:

source: Find corresponding message
ru: Найти соответствующее сообщение

source: Secret exponent length:
ru: Длина секретной экспоненты:

source: RSA modulus length:
ru: Длина модуля РША:

source: Use Carmichael function instead of Euler totient function
ru: Использовать функцию Кармайкла вместо функции Эйлера

source: Generate RSA keys
ru: Сгенерировать ключи РША

source: View RSA keys
ru: Показать ключи РША

source: Public exponent "e" is:
ru: Открытая экспонента "e":

source: Public modulus "n" is:
ru: Модуль криптосистемы "n":

source: Execute Wiener's attack
ru: Выполнить атаку Винера

source: Discovered secret exponent "d" is:
ru: Найденная секретная экспонента "d":

source: Prime number "p" is:
ru: Простое число "p":

source: Prime number "q" is:
ru: Простое число "q":

source: View keys
ru: Показать ключи

source: Random "x" from coprime to RSA modulus:
ru: Случайное число "x" взаимнопростое с модулем криптосистемы:

source: Generate coprime "x"
ru: Сгенерировать "x"

source: Calculate C' = C*x^e mod n
ru: Посчитать C' = C*x^e mod n

source: Decrypt C'
ru: Дешифровать C'

source: Calculate M = M' * x^(-1) mod n
ru: Посчитать M = M' * x^(-1) mod n

source: View RSA keys
ru: Показать ключи

source: Given ciphertext:
ru: Известная криптограмма:

source: Execute cyclic attack
ru: Выполнить циклическую атаку

source: Find the smallest 'k' such that C^e^k = C
ru: Найти минимально возможное 'k' такое, что C^e^k = C

source: C^e^k mod n == C, where k is:
ru: C^e^k mod n == C, где k равно:

source: Thus message M = C^e^(k-1) mod n:
ru: Таким образом, исходное сообщение M = C^e^(k-1) mod n:

source: Execute generalized cycling attack
ru: Выполнить обобщенную циклическую атаку

source: Generate 2 RSA key sets using common modulus
ru: Сгенерировать 2 набора ключей с общим модулем

source: 1st user RSA keys
ru: Ключи 1го пользователя

source: 2nd user RSA keys
ru: Ключи 2го пользователя

source: Factoring "n" given both exponents "e" and "d"
ru: Фактризация "n", зная обе экспоненты "e" и "d"

source: Find factors of "n"
ru: Найти делители "n"

source: g^(k*2^i) mod n is equal to 1, while x = g^(k*2^i-1) mod n is not equal to 1 or -1, where g:
ru: g^(k*2^i) mod n равно 1, при этом x = g^(k*2^i-1) mod n не равно 1 или -1, где g равно:

source: and odd number k = (e*d-1) / 2^t:
ru: и нечетное число k = (e*d-1) / 2^t:

source: Thus p = gcd(x+1, n):
ru: Тогда p = gcd(x+1, n):

source: and q = gcd(x+1, n):
ru: и q = gcd(x+1, n):

source: Calculation of "d" of 2nd user
ru: Вычисление "d" 2го пользователя

source: Calculate "d"
ru: Вычислить "d"

source: Set seed manually
ru: Задать начальное состояние вручную

source: Public key
ru: Открытый ключ

source: Public exponent 'e':
ru: Открытая экспонента 'e':

source: RSA modulus 'n':
ru: РША модуль 'n':

source: Secret key
ru: Секретная экспонента

source: Secret exponent 'd':
ru: Секретная экспонента 'd':

source: Prime number 'p':
ru: Простое число 'p':

source: Prime number 'q':
ru: Простое число 'q':

source: g^(k*2^%i) mod n is equal to 1, while x = g^(k*2^%i) mod n is not equal to 1 or -1, where g:
ru: g^(k*2^%i) mod n равно 1, при этом x = g^(k*2^%i) mod n не равно 1 или -1, где g равно:

source: and odd number k = (e*d-1) / 2^%i:
ru: и нечетное число k = (e*d-1) / 2^%i:

source: n/a
ru: н/д

source: The message should be between 1 and n-1 inclusive
ru: Сообщение должно быть от 1 до n-1 включительно

source: Failed to apply Cyclic attack in %i seconds!
ru: Не удалось выполнить циклическую атаку в течении %i секунд!

source: Ciphertext #%d
ru: Криптограмма #%d

source: Possible message #%d
ru: Возможное сообщение #%d

source: Given ciphertext corresponds to possible message #%i
ru: Данная криптограмма соответствует возможному сообщению #%i

source: Failed to find message in %i seconds using linear search! Aborted. Generate a new list of possible messages with lower number of messages or decrease the size of RSA modulus.
ru: Не удалось найти сообщение в течении %i секунд путем перебора известных сообщений! Операция прервана. Сгенерируйте новый список с меньшим числом возможных сообщений или сгенерируйте ключи меньшей длины.

source: None of given possible messages corresponds to given ciphertext
ru: Ни одно из возможных сообщений не соответствует данной криптограмме

source: You should generate keys first
ru: Сначала следует сгенерировать ключи

source: You should generate message for encryption first
ru: Сначала нужно сгенерировать шифруемое сообщение

source: The entered value is not integer
ru: Введенное значение не является целым числом

source: Failed to apply Wiener's attack!
ru: Не удалось выполнить атаку Винера!

source: Please choose language:
ru: Выберите язык:

source: Language
ru: Язык:

source: This language is not supported by the system.
ru: Данный язык не поддерживается системой

source: RSA Attacks lab activity
ru: Лабораторная "Побочные атаки на РША"

source: Random numbers generator
ru: Генератор случайных чисел

source: RSA keys
ru: Ключи РША
